{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Confused",
    "1": "Frustrated",
    "2": "Curious",
    "3": "Confident",
    "4": "Excited",
    "5": "Anxious",
    "6": "Neutral"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Anxious": 5,
    "Confident": 3,
    "Confused": 0,
    "Curious": 2,
    "Excited": 4,
    "Frustrated": 1,
    "Neutral": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "vocab_size": 30522
}
